from .. import loader

class txAM_Lib(loader.Library):
  developer = "@ToXicUse"
  version = (0, 0, 2)

  # AntiMat
  matlist = ['пизда', 'хуй', 'блять', 'пиздец', 'сука', 'еблан', 'долбоеб']
  



  # Words
  a = ['Аршин', 'Абзац', 'Авантюризм', 'Азот', 'Аминь', 'Автоматизм', 'Абонемент', 'Аврал', 'Аборт', 'Анонс', 'Арбуз', 'Аккорд', 'Афронт', 'Аффект', 'Апартамент', 'Ампир', 'Амбар', 'Ангажемент', 'Аэростат', 'Арбуз', 'Арфист', 'Аквамарин', 'Ажур', 'Артист']
  b = ['Ба', 'бант', 'банк', 'баба', 'банан', 'бак', 'басня', 'башня', 'банка', 'батон', 'баян', 'балкон', 'баран', 'барабан', 'багаж', 'баранка', 'бабочка', 'балка', 'багор', 'багет', 'бабушка', 'балет', 'боязнь', 'борьба', 'борода', 'бобёр', 'бамбук', 'багульник', 'бадья', 'база', 'базар', 'байка', 'бакен', 'баклан', 'баклажан', 'бактерия', 'бал', 'балаган', 'баллада', 'баловать', 'бальзам', 'банда', 'бандит', 'банкет', 'банкир', 'баня', 'барак', 'баранка', 'баранина', 'барашек', 'баржа', 'барин', 'барс', 'бархат', 'барыня', 'бас', 'батут', 'батюшка', 'батарейка', 'башмак']
  v = ['ВИНТ', 'ВОЛЯ', 'ВАЗА', 'ВАТА', 'ВВОД', 'ВДОХ', 'ВРАГ', 'ВЕЕР', 'ВЕКО',  'ВЕНА', 'ВЕРА', 'ВЕРХ', 'ВЕСЫ', 'ВЕСЬ', 'ВЕЩЬ', 'ВЗОР', 'ВИЗА', 'ВИЗГ', 'ВКУС', 'ВИЛЫ', 'ВИНО', 'ВНИЗ', 'ВНУК', 'ВОДА', 'ВОИН', 'ВОЛЯ', 'ВОЛК', 'ВОНЬ', 'ВРАЧ', 'ВХОД', 'ВЫПЬ', 'ВЬЮН', 'ВЫСЬ', 'ВАГОН', 'ВАЗОН', 'ВАЛИК', 'ВАЖНО', 'ВИЛКА', 'ВАЛУН', 'ВАЛЬС', 'ВАННА', 'ВАРАН', 'ВАРЯГ', 'ВЕТЕР', 'ВАФЛЯ', 'ВЕТКА', 'ВАТКА', 'ВАХТА', 'ВДОВА', 'ВЕДРО', 'ВЕНЕЦ', 'ВЕНИК', 'ВЕНОК', 'ВЕПРЬ', 'ВЕРБА', 'ВЕСЛО', 'ВЕСНА', 'ВЗВОД', 'ВЗДОХ', 'ВЫДОХ', 'ВИРАЖ', 'ВИСОК', 'ВИЗИТ', 'ВЗРЫВ', 'ВИХРЬ', 'ВИХОР', 'ВОЖДЬ', 'ВОЖАК', 'ВОЗОК', 'ВОЙНА', 'ВОЛНА', 'ВОЛОС', 'ВОПЛЬ', 'ВОРОН', 'ВУАЛЬ']
  g = ['ГАЛЕРА', 'ГАЛЕТА', 'ГАЛИФЕ', 'ГАЛОШИ', 'ГАМБИТ', 'ГАРАНТ', 'ГАРПИЯ', 'ГАРПУН', 'ГЕЙЗЕР', 'ГЕКТАР', 'ГВОЗДЬ', 'ГЕОЛОГ', 'ГЕРАНЬ', 'ГИББОН', 'ГИГАНТ', 'ГИЛЬЗА', 'ГИТАРА', 'ГЛАГОЛ', 'ГЛОБУС', 'ГЛАНДЫ', 'ГЛУПЕЦ', 'ГНЕЗДО', 'ГОЛУБЬ', 'ГОЛЕНЬ', 'ГОНЧАР', 'ГОНЧИЙ', 'ГРАБЛИ', 'ГРАВИЙ', 'ГРАНАТ', 'ГРАНИТ', 'ГРАФИК', 'ГРАФИН', 'ГРАЦИЯ', 'ГРАДУС', 'ГОЛОВА', 'ГЛОТОК', 'ГИПНОЗ', 'ГЕПАРД', 'ГАРНИР']
  d = ['ДАЙ', 'ДАР', 'ДЕД', 'ДНО', 'ДОК', 'дом', 'ДОГ', 'ДОЛ', 'дуб', 'ДАЛЬ', 'ДАЧА', 'ДАНЬ', 'ДАТА', 'ДВОР', 'ДЕЛО', 'ДЕТИ', 'ДЖЕМ', 'ДЖАЗ', 'ДЖИН', 'ДИСК', 'ДИТЯ', 'ДИЧЬ', 'ДИЕЗ', 'ДОЛГ', 'ДОЛЯ', 'ДОЧЬ', 'ДРУГ', 'ДУГА', 'ДУХИ', 'ДУЭТ', 'ДЫНЯ', 'ДЮНА', 'ДАМБА', 'ДАМКА', 'ДВЕРИ', 'ДЕБЮТ', 'ДЕВИЗ', 'ДЕКОР', 'ДЕМОН', 'ДЖИНН', 'ДЗЮДО', 'ДИВАН', 'ДИЕТА', 'ДОЖДЬ', 'ДОЗОР', 'ДОНОР', 'ДОСКА', 'ДОСУГ', 'ДОЧКА', 'ДРАГА', 'ДРЕЛЬ', 'ДРОБЬ', 'ДРОВА', 'ДРОЖЬ', ]
  e = ['ЕДА', 'ЁРШ', 'ЕЛЬ', 'ЕЩЁ', 'ЕДОК', 'ЕЗДА', 'ЁЛКА', 'ЕРИК', 'ЕНОТ', 'ЕЛЕЙ', 'ЕДВА', 'ЕСЛИ', 'ЕГЕРЬ', 'ЕГОЗА', 'ЁРШИК', 'ЕСАУЛ', 'ЕВРОПА', 'ЕГИПЕТ', 'ЁЛОЧКА', 'ЕРАЛАШ', 'ЕХИДНА', 'ЕРУНДА', 'ЕДИНИЦА', 'ЕЖЕВИКА', 'ЕЗДОВОЙ', 'ЕРМОЛКА', 'ЕПАРХИЯ', 'ЕСТЕСТВО', 'ЕДИНОРОГ', 'ЕЖЕДНЕВНИК',  'ЕДИНОДУШИЕ']
  ee = ['хуй']
  j = ['хуй']
  z = ['хуй']
  i = ['хуй']
  ii = ['хуй']
  k = ['хуй']
  l = ['хуй']
  m = ['хуй']
  n = ['хуй']
  o = ['хуй']
  p = ['хуй']
  r = ['хуй']
  s = ['хуй']
  t = ['хуй']
  u = ['хуй']
  f = ['хуй']
  h = ['хуй']
  c = ['хуй']
  ch = ['хуй']
  sh = ['хуй']
  shh = ['хуй']
  iii = ['хуй']
  eee = ['хуй']
  uu = ['хуй']
  aa = ['хуй']


