from .. import loader

class txAM_Lib(loader.Library):
  developer = "@ToXicUse"
  version = (0, 0, 2)

  # AntiMat
  matlist = ['пизда', 'хуй', 'блять', 'пиздец', 'сука', 'еблан', 'долбоеб']
  



  # Words
  a = ['Аршин', 'Абзац', 'Авантюризм', 'Азот', 'Аминь', 'Автоматизм', 'Абонемент', 'Аврал', 'Аборт', 'Анонс', 'Арбуз', 'Аккорд', 'Афронт', 'Аффект', 'Апартамент', 'Ампир', 'Амбар', 'Ангажемент', 'Аэростат', 'Арбуз', 'Арфист', 'Аквамарин', 'Ажур', 'Артист']
  b = ['Ба', 'бант', 'банк', 'баба', 'банан', 'бак', 'басня', 'башня', 'банка', 'батон', 'баян', 'балкон', 'баран', 'барабан', 'багаж', 'баранка', 'бабочка', 'балка', 'багор', 'багет', 'бабушка', 'балет', 'боязнь', 'борьба', 'борода', 'бобёр', 'бамбук', 'багульник', 'бадья', 'база', 'базар', 'байка', 'бакен', 'баклан', 'баклажан', 'бактерия', 'бал', 'балаган', 'баллада', 'баловать', 'бальзам', 'банда', 'бандит', 'банкет', 'банкир', 'баня', 'барак', 'баранка', 'баранина', 'барашек', 'баржа', 'барин', 'барс', 'бархат', 'барыня', 'бас', 'батут', 'батюшка', 'батарейка', 'башмак']
  v = ['хуй']
  g = ['хуй']
  d = ['хуй']
  e = ['хуй']
  ee = ['хуй']
  j = ['хуй']
  z = ['хуй']
  i = ['хуй']
  ii = ['хуй']
  k = ['хуй']
  l = ['хуй']
  m = ['хуй']
  n = ['хуй']
  o = ['хуй']
  p = ['хуй']
  r = ['хуй']
  s = ['хуй']
  t = ['хуй']
  u = ['хуй']
  f = ['хуй']
  h = ['хуй']
  c = ['хуй']
  ch = ['хуй']
  sh = ['хуй']
  shh = ['хуй']
  iii = ['хуй']
  eee = ['хуй']
  uu = ['хуй']
  aa = ['хуй']

